{"basics":{"name":"Zihe Song (宋子鹤）","label":"PhD Candidate in Computer Science","image":"","email":"zihe.song@utdallas.edu","phone":"","url":"https://zihesong.github.io","summary":"PhD candidate in Computer Science at The University of Texas at Dallas. My research lies at the intersection of large language models, software testing, and human–computer interaction, with a focus on LLM-driven UI agents, mobile app testing, and efficiency robustness of deep learning systems.","location":{"address":"","postalCode":"75080","city":"Richardson","countryCode":"US","region":"Texas"},"profiles":[{"network":"Google Scholar","username":"Zihe Song","url":"https://scholar.google.com/citations?user=FXfaN4EAAAAJ"},{"network":"GitHub","username":"zihesong","url":"https://github.com/zihesong"},{"network":"LinkedIn","username":"Zihe (Zoe) Song","url":"https://www.linkedin.com/in/zoooesong/"}]},"education":[{"institution":"The University of Texas at Dallas","location":"Richardson, TX, USA","area":"Computer Science","studyType":"PhD","startDate":"2020-01-01","endDate":"","advisor":"Dr. Wei Yang","research":["Specializing in Android systems, program analysis, ML infrastructure, and large-scale debugging and testing tools.","Experienced in building production-grade systems across analysis, UI exploration, and ML evaluation pipelines.","Published at ISSTA, USENIX Security, CVPR, ASPLOS, ICSE, MobileSoft, etc. Finalist in Amazon Nova AI Challenge."]},{"institution":"The University of Texas at Dallas","location":"Richardson, TX, USA","area":"Computer Science","studyType":"M.S.","startDate":"2018-08-01","endDate":"2020-08-31"},{"institution":"University of Electronic Science and Technology of China (UESTC)","location":"Chengdu, China","area":"Communication Engineering","studyType":"B.Eng.","startDate":"2014-09-01","endDate":"2018-06-30"}],"competitions":[{"title":"Amazon Nova AI Challenge – Finalist (Published in Amazon Science Trusted AI 2025)","date":"2025","organization":"Amazon Science","details":["Designed adversarial attack strategies for LLMs, uncovering multiple high-severity vulnerabilities in generation behavior.","Contributed to COMET, a malicious-elicitation framework that improved evaluation throughput and automated red teaming."]}],"publications":[{"name":"TaOPT: Tool-agnostic optimization of parallelized automated mobile UI testing (Co-first author)","publisher":"ASPLOS 2025"},{"name":"Can You Mimic Me? Exploring the use of Android Record & Replay tools in debugging (First author)","publisher":"MOBILESoft 2025"},{"name":"An investigation on numerical bugs in GPU programs towards automated bug detection","publisher":"ISSTA 2025"},{"name":"SoK: Efficiency robustness of dynamic deep learning systems (Co-second author)","publisher":"USENIX Security 2025"},{"name":"Guardian: A runtime framework for LLM-based UI exploration","publisher":"ISSTA 2024"},{"name":"WEFix: Intelligent automatic generation of explicit waits for efficient web end-to-end flaky tests","publisher":"WWW 2024"},{"name":"NICGSlowDown: Evaluating the efficiency robustness of neural image caption generation models (Co-first author)","publisher":"CVPR 2022"},{"name":"An empirical analysis of compatibility issues for industrial mobile games","publisher":"ISSRE 2022"},{"name":"NMTSloth: Understanding and testing efficiency degradation of neural machine translation systems","publisher":"ESEC/FSE 2022"},{"name":"An empirical analysis of UI-based flaky tests (Co-first author)","publisher":"ICSE 2021"},{"name":"An automated framework for gaming platform to test multiple games","publisher":"ICSE 2020"}],"projects":[{"name":"Multimodal Agent Framework for Android App Generation (ICLR 2026 under review)","summary":"A multimodal LLM agent framework for generating full Android apps from natural-language specifications and evaluating functional correctness at scale.","highlights":["Built a benchmark of 101 real-world Android tasks requiring LLMs to implement full apps from natural-language specs.","Developed a multi-agent system to summarize app docs and navigate apps to generate functional test cases automatically.","Designed an automated evaluation pipeline revealing that current LLMs achieve only ~18.8% functional correctness."]},{"name":"LLM-Driven Smartphone Interaction Enhancement","summary":"A research project focused on improving intent disambiguation, UI navigation reliability, and clarification question generation for mobile LLM interaction.","highlights":["Built an LLM-driven interaction framework that improves intent disambiguation and UI navigation reliability across apps.","Built a multi-agent reasoning pipeline combining screenshots, view hierarchies, and NL instructions for robust control.","Designed clarification-prompt models that reduce ambiguous user intents and increase UI navigation task success rates."]}],"internship":[{"name":"NetEase Fuxi AI Lab","location":"Hangzhou, China (remote during internship)","position":"Research Intern","startDate":"2020-05-15","endDate":"2020-12-15","summary":"Worked with the Fuxi Lab game AI team on large-scale testing and compatibility analysis for industrial mobile games.","highlights":["Built an automated game testing framework to simulate diverse player behaviors and increase overall interaction coverage.""Applied GAIL-based RL models to generate gameplay trajectories, reducing QA workload and improving test robustness.""Conducted a large-scale study on game compatibility issues, informing debugging workflows and device optimizations."]}],"research supervision":[{"title":"Graduate Research Supervision","details":"Supervised master's students conducting software engineering research, building a scalable multilingual automated bug-repair data collection framework; the resulting paper has been submitted to TOSEM."}],"teaching_experience":[{"title":"Independent Teaching (UT Dallas Graduate Teaching Certificate earned)","details":["CS 1325 – Introduction to Programming (C/C++), UT Dallas, Spring 2026.","ECS 1100 – Introduction to Engineering and Computer Science, UT Dallas, Fall 2025.","Served as a teaching assistant for multiple courses including Artificial Intelligence, Algorithm Design and Analysis, and Big Data Management and Analytics, UT Dallas, Spring 2020 – Spring 2025."]}],"skills":[{"name":"Programming","level":"","icon":"fa-solid fa-code","keywords":["Python","Java","C/C++","Bash","SQL"]},{"name":"Machine Learning & LLMs","level":"","icon":"fa-solid fa-brain","keywords":["Large language models and instruction tuning","Reinforcement learning and RLHF-style workflows","PyTorch, TensorFlow, HuggingFace","Adversarial and efficiency robustness of deep models"]},{"name":"Software Engineering & Testing","level":"","icon":"fa-solid fa-bug","keywords":["Android UI testing (Espresso, Appium, DroidBot, Stoat, TaOPT, Guardian)","Web end-to-end testing and flaky test analysis","Program analysis and automated debugging","Benchmark and infrastructure design for LLM agents"]},{"name":"Systems & Tools","level":"","icon":"fa-solid fa-server","keywords":["Linux, Git, Docker","Android SDK, adb, emulators","Distributed experiment management and data pipelines"]}],"languages":[{"language":"Chinese (Mandarin)","fluency":"Native","icon":""},{"language":"English","fluency":"Fluent (research and teaching)","icon":""}],"interests":[{"name":"Research","icon":"fa-solid fa-flask","keywords":["LLM-based UI agents and intelligent interaction","Software testing and debugging automation","Efficiency robustness of deep learning systems"]},{"name":"Hobbies","icon":"fa-solid fa-mountain-sun","keywords":["Tennis","Skiing","Baking and coffee","Travel and photography"]}]}